Revit 2027 API
ParameterTypeId.StairsRunCreateOffset Property
 "Offset": Built-in param for binding sketch offset with Ribbon UI controls
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRunCreateOffset { get; }
Public Shared ReadOnly Property StairsRunCreateOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRunCreateOffset {
	ForgeTypeId^ get ();
}
static member StairsRunCreateOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace